In [ ]:
#Q.1 Question :As we have learned to find out statistical test like mean median standard deviation using
#python so practice those methods and using the results write down 10 hypothesis and submit.

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
dataset1=pd.read_excel(â€˜general_data.xlsx', sheet_name=0) 
dataset1.head() dataset1.columns
dataset1.isnull()
dataset1.duplicated()
dataset1.drop_duplicates()
dataset3=dataset1[['Age','DistanceFromHome','Education','MonthlyIncome','NumCompaniesWorked', 'PercentSalaryHike','TotalWorkingYears', 'TrainingTimesLastYear',
'YearsAtCompany','YearsSinceLastPromotion', 'YearsWithCurrManager']].describe()
dataset3=dataset1[['Age','DistanceFromHome','Education','MonthlyIncome',
'NumCompaniesWorked', 'PercentSalaryHike','TotalWorkingYears', 'TrainingTimesLastYear',
'YearsAtCompany','YearsSinceLastPromotion', 'YearsWithCurrManager']].median()
dataset3=dataset1[['Age','DistanceFromHome','Education','MonthlyIncome',
'NumCompaniesWorked', 'PercentSalaryHike','TotalWorkingYears', 'TrainingTimesLastYear',
'YearsAtCompany','YearsSinceLastPromotion', 'YearsWithCurrManager']].mode()
dataset3=dataset1[['Age','DistanceFromHome','Education','MonthlyIncome',
'NumCompaniesWorked', 'PercentSalaryHike','TotalWorkingYears', 'TrainingTimesLastYear',
'YearsAtCompany','YearsSinceLastPromotion', 'YearsWithCurrManager']].var()
dataset3=dataset1[['Age','DistanceFromHome','Education','MonthlyIncome',
'NumCompaniesWorked', 'PercentSalaryHike','TotalWorkingYears', 'TrainingTimesLastYear',
'YearsAtCompany','YearsSinceLastPromotion', 'YearsWithCurrManager']].skew()
dataset3=dataset1[['Age','DistanceFromHome','Education','MonthlyIncome',
'NumCompaniesWorked', 'PercentSalaryHike','TotalWorkingYears', 'TrainingTimesLastYear',
'YearsAtCompany','YearsSinceLastPromotion', 'YearsWithCurrManager']].kurt()
box_plot=dataset1.Age
plt.boxplot(box_plot)
box_plot=dataset1.MonthlyIncome
plt.boxplot(box_plot)
box_plot=dataset1.YearsAtCompany
plt.boxplot(box_plot)

In [9]:
import pandas as pd

from scipy.stats import wilcoxon

dataset=pd.read_excel("Wilcoxon.xlsx",sheet_name=0)

dataset.head()

   ID  TRT  AGE  WEIGHIN  STAGE  TOTALCIN  TOTALCW2  TOTALCW4 TOTALCW6
0   1    0   52    124.0      2         6         6         6        7
1   5    0   77    160.0      1         9         6        10        9
2   6    0   60    136.5      4         7         9        17       19
3   9    0   61    179.6      1         6         7         9        3
4  11    0   59    175.8      2         6         7        16       13

In [10]:
d1=dataset.TOTALCIN

d2=dataset.TOTALCW2

stat, p=wilcoxon(d1,d2)

print(stat,p)

29.5 0.00259741456482452

In [11]:
from scipy.stats import friedmanchisquare

d3=dataset.TOTALCW4

stat,p=friedmanchisquare(d1,d2,d3)

print(stat,p)

27.927710843373504 8.62133745016363e-07

In [13]:
from scipy.stats import mannwhitneyu

dataset1=pd.read_excel("Mann Whitney.xlsx",sheet_name=1)

dataset1.head()

   Design1  Design2
0       11       12
1       17       10
2       16       15
3       14       19
4       15       11

In [14]:
a1=dataset1.Design1

a2=dataset1.Design2

stat,p=mannwhitneyu(a1,a2)

print(stat,p)

9.0 0.2641796636354743

In [17]:
from scipy.stats import kruskal

dataset2=pd.read_excel("Kruskal Wallis.xlsx",sheet_name=0)

dataset2.head()

   Design1  Design2  Design3  Showroom
0       11       12       23         1
1       17       10       20         2
2       16       15       18         3
3       14       19       17         4
4       15       11       10         5

In [18]:
b1=dataset2.Design1

b2=dataset2.Design2

b3=dataset2.Design3

stat,p=kruskal(b1,b2,b3)

print(stat,p)

2.7345323741007226 0.25480259087913626

In [19]:
from scipy.stats import ttest_1samp

dataset6=pd.read_excel("One Sample.xlsx",sheet_name=0)

dataset6.head()

     ids  Height
0  43783   72.35
1  20278   70.66
2  20389   70.68
3  24559   67.43
4  28980   68.45

In [20]:
h1=dataset6.Height

stat,p=ttest_1samp(h1,65)

print(stat,p)

11.498800238580099 1.087893570160242e-26

In [21]:
from scipy.stats import ttest_rel

dataset3=pd.read_excel("Paired Sample.xlsx",sheet_name=0)

dataset3.head()

     ids  English   Math
0  43783    88.24  60.02
1  20278    89.45  70.19
2  20389    96.73  71.20
3  22820    74.06  55.89
4  24559    82.61  65.52

In [22]:
p1=dataset3.English

p2=dataset3.Math

stat,p=ttest_rel(p1,p2)

print(stat,p)

36.312568981719856 3.0710987192210606e-128

In [23]:
from scipy.stats import ttest_ind

dataset4=pd.read_excel("Independent Sample.xlsx",sheet_name=3)

dataset4.head()

   Nonathelete  Athelete
0     0.004413  0.004462
1     0.004872  0.005146
2     0.008851  0.004023
3     0.006508  0.003941
4     0.006314  0.004764

In [24]:
z1=dataset4.Nonathelete

z2=dataset4.Athelete

stat,p=ttest_ind(z1,z2)

print(stat,p)

13.368790432137319 7.116633157230895e-33